package com.tshevchuk.prayer.data;

import java.util.Arrays;
import java.util.Calendar;
import java.util.Date;
import java.util.HashSet;
import java.util.Set;

import android.text.TextUtils;
import android.util.SparseArray;
import android.util.SparseIntArray;

import com.tshevchuk.prayer.data.CalendarDay.PistType;

public class CerkovnyyCalendar {
	private static final int FLAG_U_NEDILYU = 10000;

	private static CerkovnyyCalendar instance;

	private Set<Integer> svyataNerukhomi = new HashSet<Integer>(50);
	private SparseArray<String> svyataRukhomi = new SparseArray<String>(50);
	private SparseIntArray dataVelykodnya = new SparseIntArray(50);
	private SparseArray<String> dni = new SparseArray<String>(400);

	public static synchronized CerkovnyyCalendar getInstance() {
		if (instance == null) {
			instance = new CerkovnyyCalendar();
		}
		return instance;
	}

	private CerkovnyyCalendar() {
		initVelykdenDate();
		initRukhomiSvyata();

		initVeresen();
		initZhovten();
		initLystopad();
		initHruden();
		initSichen();
		initLjutyy();
		initBerezen();
		initKviten();
		initTraven();
		initCherven();
		initLypen();
		initSerpen();

		svyataNerukhomi.addAll(Arrays.asList(914, 921, 927, 1009, 1014, 1108,
				1121, 1125, 1204, 1219, 1222, 107, 108, 109, 114, 118, 119,
				212, 215, 407, 506, 516, 521, 522, 707, 712, 723, 724, 728,
				802, 806, 807, 819, 828, 911));
	}

	public CalendarDay getCalendarDay(Date day) {
		PistType pistType = PistType.Normal;
		Calendar cal = Calendar.getInstance();
		cal.setTime(day);

		int dayHreh = cal.get(Calendar.DAY_OF_MONTH);
		int monthHreh = cal.get(Calendar.MONTH) + 1;
		int yearHreh = cal.get(Calendar.YEAR);
		int dayOfYear = cal.get(Calendar.DAY_OF_YEAR);
		int dayOfWeek = cal.get(Calendar.DAY_OF_WEEK);

		cal.add(Calendar.DAY_OF_MONTH, -13);
		int dayJulian = cal.get(Calendar.DAY_OF_MONTH);
		int monthJulian = cal.get(Calendar.MONTH) + 1;

		int dateVelykdnya = dataVelykodnya.get(yearHreh);
		Calendar calVelykden = Calendar.getInstance();
		calVelykden.setTime(day);
		calVelykden.set(Calendar.MONTH, dateVelykdnya / 100 - 1);
		calVelykden.set(Calendar.DAY_OF_MONTH, dateVelykdnya % 100);
		int velykdenDayOfYear = calVelykden.get(Calendar.DAY_OF_YEAR);

		String rukhomeSvyato = svyataRukhomi.get(dayOfYear - velykdenDayOfYear);

		boolean isDateRed = dayOfWeek == Calendar.SUNDAY
				|| svyataNerukhomi.contains(dayHreh + monthHreh * 100);
		String description = dni.get(dayJulian + monthJulian * 100);
		if (!TextUtils.isEmpty(rukhomeSvyato)) {
			description += "\nРухоме: " + rukhomeSvyato;
			isDateRed = true;
		}
		description = String.format("Старий: %s.%s\n%s", dayJulian,
				monthJulian, description);
		description = description.replaceAll("<br>", "<b><r>")
				.replaceAll("</br>", "</b></r>").replaceAll("<ir>", "<i><r>")
				.replaceAll("</ir>", "</i></r>")
				.replaceAll("<r>", "<font color=\"red\">")
				.replaceAll("</r>", "</font>");
		return new CalendarDay(day, pistType, description, isDateRed);
	}

	private void initSerpen() {
		dni.put(801,
				"Похід із чесним Древом чесного Хреста; мучеників Макавеїв, і матері їх Соломії, і старця Єлеазара");
		dni.put(802, "Перенесення мощів первомуч. Стефана");
		dni.put(803, "Преп. Ісаакія, Далмата й Фавста");
		dni.put(804, "Сімох отроків, Що в Ефесі; препмуч. Євдокії");
		dni.put(805, "Передпразденство Переображення; муч. Євсигнія");
		dni.put(806, "Переображення Господнє");
		dni.put(807, "Препмуч. Дометія");
		dni.put(808, "Свят. Еміліяна, ісповідника, єп. Кизицького");
		dni.put(809, "+ Ап. Матія");
		dni.put(810, "Муч. Лаврентія, архидиякона");
		dni.put(811, "Муч. Євпла");
		dni.put(812, "Муч. Фотія й Аникити");
		dni.put(813, "Віддання Переображення; преп. Максима Ісповідника");
		dni.put(814,
				"Передпразденство Успення; прор. Міхея; + перенесення мощів преп. Теодосія Печер.");
		dni.put(815, "Успення Пресвятої Богородиці");
		dni.put(816, "Нерукотвореного образу ГНІХ; муч. Діомида");
		dni.put(817, "Муч. Мирона");
		dni.put(818, "Муч. Флора й Лавра");
		dni.put(819, "Муч. Андрея Стратопедарха і тих, Що з ним");
		dni.put(820, "Прор. Самуїла");
		dni.put(821, "Ап. Тадея; муч. Васси");
		dni.put(822, "Муч. Агатоніка і тих, що з ним");
		dni.put(823,
				"Віддання Успення; муч. Луппа; свящ. Іринея, єп. Ліонського");
		dni.put(824, "Свящ. Євтиха");
		dni.put(825, "Повернення мощів ап. Вартоломея; ап. Тита");
		dni.put(826, "Муч. Адріяна й Наталії");
		dni.put(827, "Преп. Пімена");
		dni.put(828,
				"Преп Мойсея Мурина; свят. Августина, єп. Іппонського; муч. Гебре Михаїла; собор преп. отців Печерських, що спочивають у дальніх печерах");
		dni.put(829, "Усікновення голови Йоана Предтечі");
		dni.put(830,
				"Свят. Олександра, Йоана й Павла Нового, патріярхів Царгородських");
		dni.put(831, "+ Положення пояса Пресвятої Богородиці");
	}

	private void initLypen() {
		dni.put(701, "Безср. і чудотв. Косми й Дам’яна");
		dni.put(702, "+ Положення ризи Пресвятої Богородиці у Влахерні");
		dni.put(703, "Муч. Якинта; свят. Анатолія, патр. Царгородського");
		dni.put(704, "Свят. Андрея, аєп. Критського; преп. Марти");
		dni.put(705, "+ Преп Атанасія Атонського");
		dni.put(706, "Преп. Сісоя Великого");
		dni.put(707, "Преп. Томи, що в Малеї, і Акакія, що в Ліствиці");
		dni.put(708, "Вмуч. Прокопія");
		dni.put(709, "Свящ. Панкратія, єп. Тавроменійського");
		dni.put(710,
				"+ Преп. Антонія Печерського, Київського; сорок п’ятьох муч. в Никополі Вірменській");
		dni.put(711, "Рівноап. Ольги, княгині Київської; муч. Євфимії");
		dni.put(712, "Муч. Прокла й Іларія; преп. Михаїла Малеїна");
		dni.put(713, "Собор архангела Гавриїла; преп. Стефана Савваїта");
		dni.put(714, "Ап. Акили");
		dni.put(715,
				"+ Рівноап. князя Володимира Великого; муч. Кирика і Юліти");
		dni.put(716, "Свящ. Атиногена і десятьох учнів його.");
		dni.put(FLAG_U_NEDILYU + 716, "святих Отців шести соборів.");
		dni.put(717, "Вмуч. Марини");
		dni.put(718, "Муч. Якинта й Еміліяна");
		dni.put(719, "Преп Макрини, сестри Василія Великого; преп. Дія");
		dni.put(720, "+ Пророка Іллі");
		dni.put(721, "Преп. Симеона й Йоана; прор. Єзекиїла");
		dni.put(722, "Рівноап. Марії Магдалини; повернення мощів свящ. Фоки");
		dni.put(723, "Муч. Трофима, Теофіла і тих, Що з ними");
		dni.put(724, "+ Мучеників Бориса і Гліба; вмуч. Христини");
		dni.put(725,
				"+ Успення св. Анни, матері Пресв. Богородиці; св. жінок Олімпіяди і Євпраксії");
		dni.put(726, "Свящ. Єрмолая і тих, що з ним; препмуч. Параскеви");
		dni.put(727,
				"+ Вмуч. і цілителя Пантелеймона; свят. Климента, аєп. Охридського, чудотворця");
		dni.put(728, "Ап. і дияконів Прохора, Никанора, Тимона й Пармена");
		dni.put(729, "Муч. Каленика");
		dni.put(730, "Ап. Сили, Силуана, і тих, що з ними");
		dni.put(731,
				"Передпразденство походу з чесним і животворящим Хрестом Господнім; праведного Євдокима");
	}

	private void initCherven() {
		dni.put(601, "Муч. Юстина, філософа, і тих, що з ним");
		dni.put(602, "Свят. Никифора, ісповідника");
		dni.put(603, "Муч. Лукиліяна і тих, Що з ним");
		dni.put(604, "Свят. Митрофана, патр. Царгородського");
		dni.put(605, "Свящ. Доротея, єп. Тирського; муч. Косми");
		dni.put(606,
				"Преп. Висаріона, чудотворця, і Іларіона Нового, ісповідника");
		dni.put(607, "Свящ. Теодота, єп. Анкирського");
		dni.put(608, "Перенесення мощів вмуч. Теодора Тирона");
		dni.put(609, "Свят. Кирила, аєп. Олександрійського");
		dni.put(610, "Свящ. Тимотея, єп. Пруського");
		dni.put(611, "+ Ап. Вартоломея й Варнави");
		dni.put(612, "Преп. Онуфрія Великого і Петра Атонського");
		dni.put(613, "Муч. Акилини; свят. Трифилія, єп. Левкусії Кипрської");
		dni.put(614,
				"Бл. свщнмч. єп. Миколая (Чарнецького) та 24 інших; бл. свщнмч. Омеляна (Ковча); прор. Єлисея; свят. Методія, патр. Царгородського");
		dni.put(615, "Прор. Амоса; преп. Єроніма Стридонського");
		dni.put(616, "Свят. Тихона Аматунтського");
		dni.put(617,
				"Муч. Мануїла, Савела й Ісмаїла; преп. Іпатія Руфеніянського");
		dni.put(618, "Муч. Леонтія");
		dni.put(619, "+ Ап. Юди, брата Господнього");
		dni.put(620, "Свящ. Методія, єп. Патарського");
		dni.put(621, "Муч. Юліяна Тарсійського");
		dni.put(622, "Свящ. Євсевія, єп. Самосатського");
		dni.put(623, "Муч. Агрипіни");
		dni.put(624, "Різдво св. Йоана Предтечі");
		dni.put(625, "Препмуч. Февронії");
		dni.put(626, "Преп. Давида, що в Солуні");
		dni.put(627, "Преп. Самсона, странноприємця");
		dni.put(628, "Перенесення мощів безср. Кира й Йоана");
		dni.put(629, "Верховних апостолів Петра й Павла");
		dni.put(630, "+ Собор дванадцятьох апостолів");
	}

	private void initTraven() {
		dni.put(501, "Прор. Єремії");
		dni.put(502, "Свят. Атанасія Великого, аєп. Олександрійського");
		dni.put(503, "+ Преп. Теодосія Печерського; муч. Тимотея й Маври");
		dni.put(504, "Муч. Пелагії");
		dni.put(505, "Муч. Ірини; преп. Никифора, ігумена Мидікійського");
		dni.put(506, "Многострадального Йова");
		dni.put(507, "Поява чесного Хреста в Єрусалимі; муч. Акакія");
		dni.put(508, "+ Ап. і єванг. Йоана Богослова; преп. Арсенія Великого");
		dni.put(509,
				"+ Перенесення мощів свят. Миколая; прор. Ісаї; муч. Христофора");
		dni.put(510, "+ Ап. Симона Зилота");
		dni.put(511,
				"+ Рівноап. Кирила й Методія, учителів слов’янських; свящ. Мокія");
		dni.put(512,
				"Свят. Епіфанія, єп. Кипрського, і Германа, патр. Царгородського");
		dni.put(513, "Муч. Гликерії");
		dni.put(514, "Муч. Ісидора");
		dni.put(515, "Преп. Пахомія Великого");
		dni.put(516, "Преп. Теодора Освященного");
		dni.put(517, "Ап. Андроніка і тих, що з ним");
		dni.put(518,
				"Муч. Теодота, що в Анкирі; муч. Петра, Діонисія і тих, що з ними; святих сімох дів.");
		dni.put(519, "Свящ. Патрикія, єп. Пруського, і тих, Що з ним");
		dni.put(520, "Муч. Талалея");
		dni.put(521, "+ Рівноап. Константина й Олени");
		dni.put(522, "Муч. Василиска");
		dni.put(523,
				"Преп. Михаїла, єп. Синадського; преп. Євфросинії Полоцької");
		dni.put(524,
				"Преп. Симеона, що на Дивній горі; преп. Микити, стовпника, Переяславського чудотворця");
		dni.put(525, "+ Третє віднайдення голови Йоана Предтечі");
		dni.put(526, "Ап. Карпа, одного з семидесятьох");
		dni.put(527, "Свящ. Терапонта, єп. Сардійського");
		dni.put(528, "Преп. Микити, єп. Халкидонського");
		dni.put(529, "Препмуч. Теодосії, діви");
		dni.put(530, "Преп. Ісаакія, ігумена Далматського");
		dni.put(531, "Ап. Єрмія; муч. Єрмея");
	}

	private void initKviten() {
		dni.put(401, "Преп. Марії Єгипетської");
		dni.put(402, "Преп. Тита, чудотворця");
		dni.put(403, "Преп. ісп. Микити, ігумена Мидикейського");
		dni.put(404, "Преп. Йосифа, піснописця, і Юрія, Що в Малеї");
		dni.put(405, "Муч. Теодула, Агатопода і тих, що з ними");
		dni.put(406, "+ Свят. Методія, учителя слов’янського; свят. Євтихія");
		dni.put(407, "Преп. Юрія, єп. Митилинського");
		dni.put(408, "Ап. Іродіона, Агава, Руфа, Асинкріта, Флегонта і Єрма");
		dni.put(409, "Муч. Євпсихія");
		dni.put(410, "Мучеників Терентія, Помпія і тих, що з ними");
		dni.put(411, "Свящ. Антипи, єп. Пергами Азійської");
		dni.put(412, "Преп. ісп. Василія, єп. Парійського");
		dni.put(413, "Свящ. Артемона і тих, що з ним");
		dni.put(414, "Свят. Мартина Ісповідника, папи");
		dni.put(415, "Ап. Аристарха, Пуда і Трофима");
		dni.put(416, "Мучениць-дів Агапії, Ірини й Хіонії");
		dni.put(417, "Преп. Симеона і Акакія, єп. Мелитинського");
		dni.put(418, "Преп. Йоана, учня Григорія Декаполіта");
		dni.put(419, "Преп Йоана, ветхопечерника");
		dni.put(420, "Преп. Теодора Трихіни");
		dni.put(421, "Свящ. Януарія і тих, що з ним; муч. Теодора");
		dni.put(422, "Преп. Теодора Сикеота");
		dni.put(423, "+ Великомуч Юрія Переможця");
		dni.put(424, "Муч. Сави Стратилата");
		dni.put(425, "+ Ап. і єванг. Марка");
		dni.put(426, "Свящ. Василія, єп. Амасійського");
		dni.put(427, "Свящ. Симеона; преп. Стефана, єп. Володимира Волинського");
		dni.put(428,
				"Ап. Ясона й Сосіпатра; муч. Дади, Максима й Кинтиліяна; свят. Кирила, єп. Турівського");
		dni.put(429,
				"Дев’ятьох мучеників, що в Кизиці; преп. Мемнона, чудотворця");
		dni.put(430, "+ Ап. Якова, брата св. Йоана Богослова");
	}

	private void initBerezen() {
		dni.put(301, "Препмуч. Євдокії");
		dni.put(302, "Свяіц. Теодота, єп. Киринейського");
		dni.put(303, "Муч. Євтропія і дружини його, Клеоніка й Василиска");
		dni.put(304, "Преп. Герасима, що на Йордані");
		dni.put(305, "Муч. Конона");
		dni.put(306, "Сорок двох мучеників, що в Амморії");
		dni.put(307, "Свящ. Василія, Єфрема, Капитона, Євгенія, Етерія й інших");
		dni.put(308, "Преп. ісп. Теофілакта, єп. Нікомидійського");
		dni.put(309, "+ Сорок муч, замучених у Севастійськім озері");
		dni.put(310, "Мученика Кодрата і тих, що з ним.");
		dni.put(311, "Свят. Софронія, патр. Єрусалимського");
		dni.put(312,
				"Ісп. Теофана Сигріянського; свят. Григорія Двоєслова, папи");
		dni.put(313, "Перенесення мощів свят. Никифора, патр. Царгородського");
		dni.put(314, "Преп. Венедикта");
		dni.put(315, "Муч. Агапія і з ним шести мучеників");
		dni.put(316, "Мучеників Савина й Папи");
		dni.put(317, "Преп. Олексія, чоловіка божого");
		dni.put(318, "Свят. Кирила, аєп. Єрусалимського");
		dni.put(319, "Муч. Хрисанта й Дарії");
		dni.put(320, "Преп. отців, убитих в обителі святого Сави");
		dni.put(321, "Ісп. Якова, єп. Катанського");
		dni.put(322, "Свящ. Василія, пресвітера Анкирського");
		dni.put(323, "Препмуч. Нікона і двох сот учнів його, з ним замучених");
		dni.put(324, "Передпразденство Благовіщення; преп. Захарії");
		dni.put(325, "Благовііцення Пресвятої Богородиці");
		dni.put(326, "Віддання Благовіщення; собор архангела Гавриїла");
		dni.put(327, "Муч. Матрони Солунської");
		dni.put(328, "Преп. Іларіона Нового; преп. Стефана, чудотворця.");
		dni.put(329, "Свящ. Марка й Кирила");
		dni.put(330, "Преп. Йоана, що списав Ліствицю (Небесну драбину)");
		dni.put(331, "Преп. Іпатія, єп. Гангренського");
	}

	private void initLjutyy() {
		dni.put(201, "Передпразденство Стрітення муч. Трифона");
		dni.put(202, "Стрітення Господнє");
		dni.put(203, "Симеона Богоприємця і Анни, пророчиці");
		dni.put(204, "Преп. Ісидора Пилусіотського");
		dni.put(205, "Муч. Агафії");
		dni.put(206, "Преп. Вукола, єп.; свяіц. Сілвана");
		dni.put(207, "Свят. Партенія, єп. Лампсакійського");
		dni.put(208, "Вмуч. Теодора Тирона; прор. Захарії");
		dni.put(209, "Віддання Стрітення; муч. Никифора");
		dni.put(210, "Муч. Харалампія");
		dni.put(211, "Свящ. Власія, єп. Севастійського");
		dni.put(212, "Свят Мелетія, аєп. Антіохійського");
		dni.put(213, "Преп. Мартиніяна");
		dni.put(214,
				"+ Рівноап. Кирила, учителя слов’янського; преп. Авксентія");
		dni.put(215, "Ап. Онисима");
		dni.put(216, "Муч. Памфила, Порфирія і дружини їх");
		dni.put(217, "Вмуч. Теодора Тирона");
		dni.put(218, "Свят. Льва, папи Римського");
		dni.put(219, "Ап. Архипа");
		dni.put(220, "Преп. Льва, єп. Катанського");
		dni.put(221, "Преп. Тимотея; свят. Євстатія, аєп. Антіохійського");
		dni.put(222, "Віднайдення мощів мучеників, що в Євгенії");
		dni.put(223, "Свящ. Полікарпа, єп. Смирнського");
		dni.put(224, "+ Перше і друге знайдення голови св. Йоана Предтечі");
		dni.put(225, "Свят. Тарасія, аєп. Царгородського");
		dni.put(226, "Свят. Порфирія, єп. Газського");
		dni.put(227, "Ісп. Прокопія Декаполіта");
		dni.put(228, "Ісп. Василія, спосника Прокопового");
		dni.put(229, "Преп. Касіяна");
	}

	private void initSichen() {
		dni.put(101, "Найменування ГНІХ свят. Василія Великого");
		dni.put(102, "Передпразденство Богоявлення; свят. Сильвестра, папи");
		dni.put(103, "Прор. Малахїї; муч. Гордія");
		dni.put(104, "Собор 70–ох апостолів; преп. Теоктиста");
		dni.put(105, "Навечір’я Богоявлення; муч. Теопемпта й Теони");
		dni.put(106, "Богоявлення Господнє");
		dni.put(107, "Собор св. Йоана Предтечі");
		dni.put(108, "Преп. Юрія Хозевіта; преп. Домніки; іспов. Еміліяна");
		dni.put(109, "Муч. Полієвкта");
		dni.put(110, "Свят. Григорія Нісс.; преп. Дометіяна і Маркіяна");
		dni.put(111, "+ Преп. Теодосія Великого");
		dni.put(112, "Муч. Татіяни");
		dni.put(113, "Муч. Єрміла і Стратоніка");
		dni.put(114, "Віддання Богоявлення; преп. отців, убитих у Синаї");
		dni.put(115, "Преп. Павла Тивейського і Йоана Кущника");
		dni.put(116, "Поклін кайданам св. ап. Петра");
		dni.put(117, "+ Преп. Антонія Великого");
		dni.put(118, "Свят. Атанасія й Кирила, аєп. Олександрійських");
		dni.put(119, "Преп. Макарія Єгиптянина");
		dni.put(120, "+ Преп. Євтимія Великого");
		dni.put(121, "Преп. Максима Ісповідника; муч. Неофіта");
		dni.put(122, "Ап. Тимотея; препмуч. Анастасія Перського");
		dni.put(123,
				"Пратулинських муч.; свящ. Климента, єп. Анкирського; муч. Агатангела");
		dni.put(124, "Преп. Ксенії Римлянки");
		dni.put(125, "+ Свят. Григорія Богослова, аєп. Царгородського");
		dni.put(126, "Преп. Ксенофонта і дружини його Марії");
		dni.put(127, "+ Перенесення мощів свят. Йоана Золотоустого");
		dni.put(128, "Преп. Єфрема Сирина");
		dni.put(129, "Перенесення мощів свящ. Ігнатія Богоносця");
		dni.put(130,
				"Трьох святителів: Василія Великого, Григорія Богослова, Йоана Золотоустого");
		dni.put(131, "Безср. і чудотв. Кира й Йоана");
	}

	private void initHruden() {
		dni.put(1201, "Прор. Наума");
		dni.put(1202, "Прор. Аввакума");
		dni.put(1203, "Прор. Софонїї");
		dni.put(1204, "Вмуч. Варвари; преп. Йоана Дамаскина");
		dni.put(1205, "+ Преп Сави Освяіценного");
		dni.put(1206, "Свят. Миколая, аєп. Мир Ликійських, чудотворця");
		dni.put(1207, "Свят. Амвросія, єп. Медіолянського");
		dni.put(1208, "Преп. Патапія");
		dni.put(1209, "Зачаття святої Анни, коли зачала Пресвяту Богородицю");
		dni.put(1210, "Муч. Мини, Єрмогена і Євграфа");
		dni.put(1211, "Преп Даниїла Стовпника");
		dni.put(1212, "Преп. Спиридона, єп. Трімитійського");
		dni.put(1213, "+ Муч. Євстратія, Авксентія, Євгенія, Мардарія й Ореста");
		dni.put(1214,
				"Муч. Тирса, Левкія, Филимона, Аполлонія, Аріяна й Каленика");
		dni.put(1215,
				"Свящ. Єлевтерія; преп. Павла; свят. Стефана, ісп., аєп. Сурожського");
		dni.put(1216, "Прор. Аггея");
		dni.put(1217, "Прор. Даниїла; трьох отроків, Ананії, Азарії й Мисаїла");
		dni.put(1218, "Муч. Севастіяна і дружини його");
		dni.put(1219, "Муч. Боніфатія");
		dni.put(1220,
				"<i>Передсвяття Різдва Христового</i>; Свщмч. Ігнатія Богоносця");
		dni.put(1221, "Муч. Юліяни");
		dni.put(1222, "Вмуч. Анастасії");
		dni.put(1223, "10-х мучч. Критських");
		dni.put(1224, "<i>Навечір'я Різдва Христового</i>; Препмуч Євгенії");
		dni.put(1225, "<br>⊕ РІЗДВО ХРИСТОВЕ</br>");
		dni.put(1226,
				"<br>⊕ Собор Пресвятої Богородиці і св. Йосифа Обручника</br>");
		dni.put(1227,
				"<r>Первомученика і архидиякона Стефана</r>");
		dni.put(1228, "Мучч., спалених у Нікомидії");
		dni.put(1229,
				"Св. дітей, убитих у Вифлеємі; преп. Маркела");
		dni.put(1230, "Муч. Анісії; преп. Зотика, пресвіт.");
		dni.put(1231, "<i>Віддання Різдва Христового</i>; Преп. Меланії Римлянки");
	}

	private void initLystopad() {
		dni.put(1101, "Безср. і чудотв. Косми й Дам’яна");
		dni.put(1102,
				"Муч. Акиндина, Пигасія, Афтонія, Єлпидифора й Анемподиста");
		dni.put(1103,
				"Муч. Акепсими, Йосифа й Аїтала; оновлення храму вмуч. Юрія");
		dni.put(1104, "Преп. Йоаникія Великого; муч. Никандра і Єрмея");
		dni.put(1105, "Муч. Галактіона і Єпістими");
		dni.put(1106, "Свят. Павла, архиєп. Царгородського, ісп.");
		dni.put(1107,
				"Бл. преп. Йосафати (Гордашевської); тридцять трьох муч., що в Мелітині; преп. Лазаря");
		dni.put(1108, "Собор архистратига Михаїла і інших безплотних сил");
		dni.put(1109, "Муч. Онисифора й Порфирія; преп. Матрони й Теоктисти");
		dni.put(1110, "Ап. Ераста, Олімпа, Родіона і тих, що з ними");
		dni.put(1111,
				"Муч. Мини, Віктора й Вікентія; муч. Стефаніди; преп. Теодора Студита, ісп.");
		dni.put(1112,
				"Свящ. Йосафата, аєп. Полоцького; свят. Йоана Милостивого, патр. Олександрійського; преп. Ніла");
		dni.put(1113, "+ Свят. Йоана Золотоустого, аєп. Царгородського");
		dni.put(1114, "+ Ап. Филипа");
		dni.put(1115, "Муч. і ісповідників Гурія, Самона й Авіва");
		dni.put(1116, "+ Ап. і єванг. Матея");
		dni.put(1117, "Свят. Григорія, єп. Неокесарійського, чудотв.");
		dni.put(1118, "Муч. Платона й Романа");
		dni.put(1119, "Прор. Авдія; муч. Варлаама");
		dni.put(1120,
				"Передпразденство Входу в храм; преп. Григорія Декаполіта; свят. Прокла, аєп. Царгородського");
		dni.put(1121, "Вхід у храм Пресвятої Богородиці");
		dni.put(1122, "Ап. Филимона і тих, що з ним");
		dni.put(1123, "Свят. Амфілохія і Григорія");
		dni.put(1124, "Вмуч. Катерини; вмуч. Меркурія");
		dni.put(1125,
				"Віддання Входу в храм; свящ. Климента, папи Римського, і Петра, єп. Олександрійського");
		dni.put(1126,
				"Преп. Аліпія, стовпника; пам’ять посвячення храму вмуч. Юрія, що в Києві перед воротами Святої Софії");
		dni.put(1127, "Вмуч. Якова Персянина; преп. Палладія");
		dni.put(1128, "Препмуч. Стефана Нового; муч. Іринарха");
		dni.put(1129,
				"Муч. Парамона й Філумена; преп. Акакія, про якого мова у Ліствиці");
		dni.put(1130, "+ Ап. Андрея Первозваного");
	}

	private void initZhovten() {
		dni.put(1001, "Покров Пресвятої Богородиці");
		dni.put(1002,
				"Свящ. Кипріяна; муч. Юстини; преп. Андрея, Христа ради юродивого");
		dni.put(1003, "Свящ. Діонісія Ареопагіта");
		dni.put(1004,
				"Свящ. Єротея, єп. Атенського; преп. Франціска Асижського");
		dni.put(1005, "Муч. Харитини");
		dni.put(1006, "+ Ап. Томи");
		dni.put(1007, "Муч. Сергія і Вакха");
		dni.put(1008, "Преп. Пелагії");
		dni.put(1009,
				"+ Ап. Якова Алфеєвого; преп. Андроніка і жінки його Атанасії");
		dni.put(1010, "Муч. Євлампія і Євлампії");
		dni.put(1011,
				"Ап. Филипа, диякона; преп. Теофана Начертанного, єп. Нікейського і творця канонів.");
		dni.put(FLAG_U_NEDILYU + 1011, "святих Отців сьомого собору");
		dni.put(1012,
				"Муч. Прова, Тараха й Андроніка; преп. Косми Святоградця, єп. Маюмського і творця канонів; свят. Мартина Милостивого, єп. Туринського");
		dni.put(1013, "Муч. Карпа, Папили й Агатоніка");
		dni.put(1014,
				"Преп. Параскеви Терновської; муч. Назарія, Гервасія, Протасія й Келсія");
		dni.put(1015, "Преп. Євтимія Нового; препмуч. Лукіяна");
		dni.put(1016, "Муч. Лонгина, сотника");
		dni.put(1017, "Прор. Осії; препмуч. Андрея Критського");
		dni.put(1018, "+ Ап. і єванг. Луки");
		dni.put(1019,
				"Бл. свщнмч. єп. Теодора (Ромжі); прор. Йоїла; муч. Уара; преп. Йоана Рильського");
		dni.put(1020, "Вмуч. Артемія");
		dni.put(1021, "Преп. Іларіона Великого");
		dni.put(1022,
				"Свят. Аверкія, єп. Єрапольського, чудотв.; сімох отроків, Що в Ефесі");
		dni.put(1023, "Ап. Якова, брата Господнього");
		dni.put(1024, "Муч. Арети і тих, що з ним");
		dni.put(1025, "Муч. і нотарів Маркіяна й Мартирія");
		dni.put(1026, "+ Вмуч. Димитрія Мироточця");
		dni.put(1027, "Муч. Нестора; муч. Капетоліни і рабині її Єротиїди");
		dni.put(1028,
				"Муч. Параскеви, що в Іконії, названої П’ятниця; муч. Терентія й Неоніли; преп. Стефана Савваїта, творця канонів");
		dni.put(1029, "Препмуч. Анастасії; преп. Аврамія, Ростовського чудотв.");
		dni.put(1030, "Муч. Зиновія й Зиновії, сестри його");
		dni.put(1031, "Ап. Стахія, Амплія і тих, що з ними; муч. Єпімаха");
	}

	private void initVeresen() {
		dni.put(901,
				"преп. Симеона Стовпника, і матері його; собор Пресвятої Богородиці, що в Міясинах");
		dni.put(902, "Муч. Маманта; свят. Йоана Посника, патр. Царгородського");
		dni.put(903, "Свящ. Антима, єп. Нікомидійського; преп. Теоктиста");
		dni.put(904, "Свящ. Вавили, єп. Антіохійського; прор. Мойсея Боговидця");
		dni.put(905, "Прор. Захарії, отця чесного Йоана Предтечі");
		dni.put(906,
				"Чудо архистр. Михаїла; муч. Євдоксія і тих, що з ним; преп. Архипа");
		dni.put(907, "Передпразденство Різдва Пресв. Богородиці; муч. Созонта");
		dni.put(908, "Різдво Пресвятої Богородиці");
		dni.put(909, "Праведних богоотців Йоакима й Анни; муч. Северіяна");
		dni.put(910, "Муч. Минодори, Митродори й Нимфодори");
		dni.put(911, "Преп. Теодори Олександрійської");
		dni.put(912, "Віддання Різдва Пресвятої Богородиці; свящ. Автонома");
		dni.put(913,
				"Передпразденство Воздвиження; оновлення храму св. Воскресення в Єрусалимі; свящ. Корнилія, сотника");
		dni.put(914,
				"Всемірне Воздвиження чесного 1 животворящого Хреста Господнього");
		dni.put(915, "Вмуч. Микити");
		dni.put(916, "Вмуч. Євфимії всехвальної");
		dni.put(917, "Муч. Софії і трьох її дочок, Віри, Надії й Любови");
		dni.put(918, "Преп. Євменія, єп. Гортинського, чудотв.");
		dni.put(919, "Муч. Трофима, Савватія й Доримедонта");
		dni.put(920,
				"Вмуч. Євстратія і тих, що з ним; муч. Михаїла і Теодора Чернігівських");
		dni.put(921, "Віддання Воздвиження; ап. Кодрата");
		dni.put(922, "Свящ. Фоки, єп. Синопійського");
		dni.put(923, "Зачаття св. Йоана Предтечі");
		dni.put(924, "Первомуч. і рівноап. Теклі");
		dni.put(925, "Преп. Євфросинії");
		dni.put(926, "+ Переставлення ап. і єванг. Йоана Богослова");
		dni.put(927,
				"Муч. Калістрата і дружини його; преп. Ніла Гроттаферратського");
		dni.put(928,
				"+ Преп. Харитона, ісповідника; В’ячеслава, князя чеського; собор преп. отців Печерських, що спочивають у ближніх печерах");
		dni.put(929, "Преп. Киріяка, самітника");
		dni.put(930, "Свящ. Григорія, єп. Великої Вірменії");
	}

	private void initRukhomiSvyata() {
		svyataRukhomi.put(-70, "Неділя про митаря і фарисея");
		svyataRukhomi.put(-63, "Неділя про блудного сина");
		svyataRukhomi.put(-57, "Субота м’ясопусна (заупокійна)");
		svyataRukhomi.put(-56, "Неділя м’ясопусна");
		svyataRukhomi.put(-49, "Неділя сиропусна");
		svyataRukhomi.put(-48, "Початок Великого посту (понеділок)");
		svyataRukhomi.put(-42, "Перша неділя посту");
		svyataRukhomi.put(-35, "Друга неділя посту");
		svyataRukhomi.put(-28, "Третя неділя посту, Хрестопоклонна");
		svyataRukhomi.put(-21, "Четверта неділя посту");
		svyataRukhomi.put(-18, "П’ята середа посту (поклони)");
		svyataRukhomi.put(-15, "П’ята субота посту, акафістова");
		svyataRukhomi.put(-14, "П’ята неділя посту");
		svyataRukhomi.put(-8, "Шоста субота, Лазарева");
		svyataRukhomi.put(-7, "Квітна неділя");
		svyataRukhomi.put(-3, "Великий четвер (страсті)");
		svyataRukhomi.put(-2, "Велика п’ятниця (плащаниця)");
		svyataRukhomi.put(-1, "Велика субота");
		svyataRukhomi.put(0, "Воскресення Христове");
		svyataRukhomi.put(1, "Світлий понеділок");
		svyataRukhomi.put(2, "Світлий вівторок");
		svyataRukhomi.put(7, "Неділя про Тому");
		svyataRukhomi.put(14, "Неділя про мироносиць");
		svyataRukhomi.put(21, "Неділя про розслабленого");
		svyataRukhomi.put(24, "Середа переполовення");
		svyataRukhomi.put(28, "Неділя про самарянку");
		svyataRukhomi.put(35, "Неділя про сліпородженогою");
		svyataRukhomi.put(39, "Вознесення Господнє");
		svyataRukhomi.put(42, "Неділя святих Отців");
		svyataRukhomi.put(48, "Субота заупокійна");
		svyataRukhomi.put(49, "Зіслання Святого Духа, П’ятдесятниця.");
		svyataRukhomi.put(50, "Понеділок Святого Духа");
		svyataRukhomi
				.put(56,
						"Неділя всіх святих. Пресвятої Євхаристії. Христа Чоловіколюбця. Сострадання Пресвятої Богородиці. Всіх святих українського народу");
	}

	private void initVelykdenDate() {
		dataVelykodnya.put(2003, 427);
		dataVelykodnya.put(2004, 411);
		dataVelykodnya.put(2005, 501);
		dataVelykodnya.put(2006, 423);
		dataVelykodnya.put(2007, 408);
		dataVelykodnya.put(2008, 427);
		dataVelykodnya.put(2009, 419);
		dataVelykodnya.put(2010, 404);
		dataVelykodnya.put(2011, 424);
		dataVelykodnya.put(2012, 415);
		dataVelykodnya.put(2013, 505);
		dataVelykodnya.put(2014, 420);
		dataVelykodnya.put(2015, 412);
		dataVelykodnya.put(2016, 501);
		dataVelykodnya.put(2017, 416);
		dataVelykodnya.put(2018, 408);
		dataVelykodnya.put(2019, 428);
		dataVelykodnya.put(2020, 419);
		dataVelykodnya.put(2021, 502);
		dataVelykodnya.put(2022, 424);
		dataVelykodnya.put(2023, 416);
		dataVelykodnya.put(2024, 505);
		dataVelykodnya.put(2025, 420);
		dataVelykodnya.put(2026, 412);
		dataVelykodnya.put(2027, 505);
		dataVelykodnya.put(2028, 416);
		dataVelykodnya.put(2029, 408);
		dataVelykodnya.put(2030, 428);
		dataVelykodnya.put(2031, 413);
		dataVelykodnya.put(2032, 502);
		dataVelykodnya.put(2033, 424);
		dataVelykodnya.put(2034, 409);
		dataVelykodnya.put(2035, 429);
		dataVelykodnya.put(2036, 420);
		dataVelykodnya.put(2037, 405);
		dataVelykodnya.put(2038, 425);
		dataVelykodnya.put(2039, 417);
		dataVelykodnya.put(2040, 506);
		dataVelykodnya.put(2041, 421);
		dataVelykodnya.put(2042, 413);
		dataVelykodnya.put(2043, 503);
		dataVelykodnya.put(2044, 424);
		dataVelykodnya.put(2045, 409);
		dataVelykodnya.put(2046, 429);
		dataVelykodnya.put(2047, 421);
		dataVelykodnya.put(2048, 405);
		dataVelykodnya.put(2049, 425);
		dataVelykodnya.put(2050, 417);
	}

}