[
   {
      "title":"Щоденні молитви",
      "content":[
         {
            "subtitle":"",
            "text":"В ім’я Отця, і Сина, і Святого Духа. Амінь. (З р.).\nМолитвами святих Отців наших, Господи, Ісусе Христе, Боже наш, помилуй нас.\nАмінь.\nСлава Тобі, Боже наш, слава Тобі."
         },
         {
            "subtitle":"Молитва до Святого Духа",
            "text":"Царю небесний, утішителю, Душе істини, що всюди єси і все наповняєш, скарбе дібр і життя подателю, прийди і вселися в нас, і очисти нас від усякої скверни, і спаси, Благий, душі наші."
         },
         {
            "subtitle":"Трисвяте",
            "text":"Святий Боже, святий Кріпкий, святий Безсмертний, помилуй нас (З р.)."
         },
         {
            "subtitle":"Славослов’я",
            "text":"Слава Отцю, і Сину, і Святому Духові, і нині, і повсякчас, і на віки вічні. Амінь."
         },
         {
            "subtitle":"Молитва до Пресвятої Тройці",
            "text":"Пресвята Тройце, помилуй нас; Господи, очисти гріхи наші; Владико, прости беззаконня наші; Святий, завітай і зціли немочі наші імени Tвого ради.\nГосподи, помилуй (3 р.).\nСлава Отцю, і Сину, і Святому Духові, i нині і повсякчас, і на віки вічні. Амінь."
         },
         {
            "subtitle":"Господня молитва",
            "text":"Отче наш, що єси на небесах, нехай святиться Ім’я Твоє, нехай прийде Царство\nТвоє, нехай буде воля Твоя, як на небі, так і на землі. Хліб наш насущний дай нам сьогодні, і прости нам провини наші, як і ми прощаємо винуватцям нашим, і не введи нас у спокусу, але визволи нас від лукавого.\nБо твоє є царство, і сила, і слава, Отця, і Сина, і Святого Духа, нині і повсякчас, і на віки вічні. Амінь.\nГосподи, помилуй (12 р.).\nСлава Отцю, і Сину, і Святому Духові, i нині, і повсякчас, і на віки вічні. Амінь."
         },
         {
            "subtitle":"Поклін Ісусові Христові",
            "text":"Прийдіте, поклонімся Цареві нашому Богу.\nПрийдіте, поклонімся Христові, Цареві нашому Богу.\nПрийдіте, поклонімся і припадім до самого Господа Ісуса Христа, Царя і Бога нашого."
         },
         {
            "subtitle":"Псалом 50",
            "text":"Помилуй мене, Боже, з великої милости твоєї,\nі багатством щедрот твоїх очисти мене з беззаконня мого.\nОбмий мене повнотою з беззаконня мого,\nі від гріха мого очисти мене.\nБо беззаконня моє я знаю,\nі гріх мій є завжди передо мною.\nПроти тебе єдиного я згрішив\nі перед тобою зло вчинив;\nТо й правий ти в словах твоїх\nі переможеш, коли будеш судити.\nЦе бо в беззаконнях я зачатий,\nі в гріхах породила мене мати моя.\nЦе бо істину полюбив єси,\nневідоме й таємне мудрости своєї явив ти мені.\nОкропи мене іссопом, і очищуся,\nобмий мене, і стану біліший від снігу.\nДай мені відчути радість і веселість,\nзрадіють кості сокрушені.\nВідверни лице твоє від гріхів моїх,\nі всі беззаконня мої очисти.\nСерце чисте створи в мені, Боже,\nі духа правого обнови в нутрі моєму.\nНе відкинь мене від лиця твого,\nі Духа твого Святого не відійми від мене.\nПоверни мені радість спасіння твого,\nі духом владичним утверди мене.\nВкажу беззаконним дороги твої,\nі нечестиві до тебе навернуться.\nВизволь мене від вини крови, Боже, Боже спасіння мого,\nі язик мій радісно прославить справедливість твою.\nГосподи, губи мої відкрий,\nі уста мої сповістять хвалу твою.\nБо якби ти жертви захотів, дав би я,\nта всепалення не миле тобі.\nЖертва Богові – дух сокрушений,\nсерцем сокрушеним і смиренним Бог не погордить.\nУщаслив, Господи, благоволінням твоїм Сіон,\nі нехай відбудуються стіни єрусалимські.\nТоді вподобаєш собі жертву правди, приношення і всепалення;\nтоді покладуть на вівтар твій тельців."
         },
         {
            "subtitle":"Символ віри",
            "text":"Вірую в єдиного Бога Отця, Вседержителя, творця неба і землі, і всього видимого і невидимого.\nІ в єдиного Господа Ісуса Христа, Сина Божого, єдинородного, від Отця родженого перед усіма віками.\nСвітло від світла, Бога істинного від Бога істинного, родженого, несотвореного, єдиносущного з Отцем, що через Нього все сталося.\nВін задля нас людей і нашого ради спасіння зійшов із небес, і воплотився з Духа Святого і Марії Діви, і став чоловіком.\nІ був розп’ятий за нас за Понтія Пилата, і страждав, і був похований.\nІ воскрес у третій день, згідно з Писанням.\nІ вознісся на небо, і сидить праворуч Отця.\nІ вдруге прийде зі славою судити живих і мертвих, а Його царству не буде кінця.\nІ в Духа Святого, Господа животворящого, що від Отця і Сина ісходить, що з\nОтцем і Сином рівнопокланяємий і рівнославимий, що говорив через пророків.\nВ єдину, святу, соборну й апостольську Церкву.\nІсповідую одне хрещення на відпущення гріхів.\nОчікую воскресіння мертвих і життя майбутнього віку. Амінь."
         },
         {
            "subtitle":"Покаянна молитва",
            "text":"Ослаби, прости, відпусти, Боже, прогрішення наші, добровільні і недобровільні, що в слові і в ділі, свідомі й несвідомі, що в думці й у помислі, що вдень і вночі; все нам прости, бо Ти благий і чоловіколюбець."
         },
         {
            "subtitle":"Молитви до Пресвятої Богоматері",
            "text":"Богородице Діво, радуйся, благодатна Маріє, Господь з тобою. Благословенна ти між жінками і благословенний плід лона твого, бо ти породила Христа Спаса, Ізбавителя душ наших.\nДостойно є воістину величати блаженною тебе, Богородицю, всеблаженну, і пренепорочну, і Матір Бога нашого. Чеснішу від херувимів і незрівнянно славнішу від серафимів, що без зотління Бога Слово породила, сущу Богородицю, тебе величаємо.\n\nПід твою милість прибігаємо, Богородице Діво, молитвами нашими в скорботах не погорди, але від бід визволи нас, єдина чиста і благословенна.\nПреславна Вседіво, Богородице! Прийми молитви наші і донеси їх Синові твоєму і Богові нашому, щоб спас задля тебе душі наші."
         },
         {
            "subtitle":"Молитва до ангелів",
            "text":"Всі небесні сили, святі ангели й архангели, моліть Бога за нас, грішних."
         },
         {
            "subtitle":"Молитва до всіх святих",
            "text":"Святі славні і всехвальні апостоли, пророки, мученики і всі святі, моліть Бога за нас, грішних."
         },
         {
            "subtitle":"Величання Пресвятої Тройці",
            "text":"Уповання наше – Отець, прибіжище наше – Син, і покровитель наш – Дух Святий; Тройце Свята, Боже наш – слава Тобі!."
         },
         {
            "subtitle":"Митарева молитва",
            "text":"Боже, милостивий будь мені, грішному (грішній).\nБоже, очисти гріхи мої і помилуй мене.\nБез числа нагрішив (нагрішила) я, Господи, прости мені.\nВ ім’я Отця, і Сина, і Святого Духа. Амінь (3 р.).\n"
         }
      ]
   }
]